; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v3 ?v5)
             (pred_1 ?v7 ?v2)
             (pred_7 ?v3 ?v2)
             (pred_6 ?v9 ?v3 )
	     (pred_12 ?v3)
             (pred_8 ?v10)
             (pred_11 ?v7)
             (pred_3 ?v2)
             (pred_4 ?v3)
             (pred_9 ?v7)
             (pred_2 ?v3)
             (pred_10 ))



(:action op_2
:parameters (?v6 ?v12 ?v13 ?v4)
:precondition (and (pred_8 ?v6) (pred_8 ?v12) (pred_11 ?v13) (pred_3 ?v4)
          (pred_5 ?v6 ?v12) (pred_1 ?v13 ?v4)
                   (pred_7 ?v12 ?v4) (pred_12 ?v6) 
                   (pred_4 ?v12) (pred_9 ?v13))
:effect (and  (pred_2 ?v12) (not (pred_4 ?v12))))


(:action op_4
:parameters (?v6 ?v1)
:precondition (and (pred_8 ?v6) (pred_8 ?v1)
               (pred_12 ?v6) (pred_5 ?v6 ?v1) (pred_2 ?v1))
:effect (and (pred_12 ?v1) (not (pred_12 ?v6))))

(:action op_3
:parameters (?v6 ?v13)
:precondition (and (pred_8 ?v6) (pred_11 ?v13) 
                  (pred_12 ?v6) (pred_6 ?v13 ?v6) (pred_10 ))
:effect (and (pred_9 ?v13)
   (not (pred_6 ?v13 ?v6)) (not (pred_10 ))))


(:action op_5
:parameters (?v6 ?v11 ?v8)
:precondition (and (pred_8 ?v6) (pred_11 ?v11) (pred_11 ?v8)
                  (pred_12 ?v6) (pred_9 ?v8) (pred_6 ?v11 ?v6))
:effect (and (pred_9 ?v11) (pred_6 ?v8 ?v6)
        (not (pred_9 ?v8)) (not (pred_6 ?v11 ?v6))))

(:action op_1
:parameters (?v6 ?v13)
:precondition (and (pred_8 ?v6) (pred_11 ?v13) 
                  (pred_12 ?v6) (pred_9 ?v13))
:effect (and (pred_10 ) (pred_6 ?v13 ?v6) (not (pred_9 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_06 obj_05 obj_22 obj_16 obj_09 obj_21 obj_15 obj_04 obj_14 obj_27 obj_08 obj_24 obj_18 obj_13 obj_01 obj_26 obj_25 obj_30 obj_17 obj_28 obj_10 obj_29 obj_23 obj_07
    obj_20 obj_03
    obj_02 obj_19 obj_11
    )

    (:init
       (pred_10)

       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_05)
       (pred_8 obj_22)
       (pred_8 obj_16)
       (pred_8 obj_09)
       (pred_8 obj_21)
       (pred_8 obj_15)
       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_27)
       (pred_8 obj_08)
       (pred_8 obj_24)
       (pred_8 obj_18)
       (pred_8 obj_13)
       (pred_8 obj_01)
       (pred_8 obj_26)
       (pred_8 obj_25)
       (pred_8 obj_30)
       (pred_8 obj_17)
       (pred_8 obj_28)
       (pred_8 obj_10)
       (pred_8 obj_29)
       (pred_8 obj_23)
       (pred_8 obj_07)
       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_11 obj_02)
       (pred_11 obj_19)
       (pred_11 obj_11)

       (pred_5 obj_12 obj_09)
       (pred_5 obj_12 obj_06)
       (pred_5 obj_06 obj_21)
       (pred_5 obj_06 obj_05)
       (pred_5 obj_06 obj_12)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_05 obj_22)
       (pred_5 obj_05 obj_06)
       (pred_5 obj_22 obj_04)
       (pred_5 obj_22 obj_16)
       (pred_5 obj_22 obj_05)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_16 obj_22)
       (pred_5 obj_09 obj_27)
       (pred_5 obj_09 obj_21)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_21 obj_08)
       (pred_5 obj_21 obj_15)
       (pred_5 obj_21 obj_06)
       (pred_5 obj_21 obj_09)
       (pred_5 obj_15 obj_24)
       (pred_5 obj_15 obj_04)
       (pred_5 obj_15 obj_05)
       (pred_5 obj_15 obj_21)
       (pred_5 obj_04 obj_18)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_04 obj_22)
       (pred_5 obj_04 obj_15)
       (pred_5 obj_14 obj_13)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_27 obj_01)
       (pred_5 obj_27 obj_08)
       (pred_5 obj_27 obj_09)
       (pred_5 obj_08 obj_26)
       (pred_5 obj_08 obj_24)
       (pred_5 obj_08 obj_21)
       (pred_5 obj_08 obj_27)
       (pred_5 obj_24 obj_25)
       (pred_5 obj_24 obj_18)
       (pred_5 obj_24 obj_15)
       (pred_5 obj_24 obj_08)
       (pred_5 obj_18 obj_30)
       (pred_5 obj_18 obj_13)
       (pred_5 obj_18 obj_04)
       (pred_5 obj_18 obj_24)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_13 obj_14)
       (pred_5 obj_13 obj_18)
       (pred_5 obj_01 obj_28)
       (pred_5 obj_01 obj_26)
       (pred_5 obj_01 obj_27)
       (pred_5 obj_26 obj_10)
       (pred_5 obj_26 obj_25)
       (pred_5 obj_26 obj_08)
       (pred_5 obj_26 obj_01)
       (pred_5 obj_25 obj_29)
       (pred_5 obj_25 obj_30)
       (pred_5 obj_25 obj_24)
       (pred_5 obj_25 obj_26)
       (pred_5 obj_30 obj_23)
       (pred_5 obj_30 obj_17)
       (pred_5 obj_30 obj_18)
       (pred_5 obj_30 obj_25)
       (pred_5 obj_17 obj_07)
       (pred_5 obj_17 obj_13)
       (pred_5 obj_17 obj_30)
       (pred_5 obj_28 obj_10)
       (pred_5 obj_28 obj_01)
       (pred_5 obj_10 obj_29)
       (pred_5 obj_10 obj_26)
       (pred_5 obj_10 obj_28)
       (pred_5 obj_29 obj_23)
       (pred_5 obj_29 obj_25)
       (pred_5 obj_29 obj_10)
       (pred_5 obj_23 obj_07)
       (pred_5 obj_23 obj_30)
       (pred_5 obj_23 obj_29)
       (pred_5 obj_07 obj_17)
       (pred_5 obj_07 obj_23)
       (pred_4 obj_01)
       (pred_4 obj_05)
       (pred_4 obj_12)
       (pred_7  obj_01 obj_20)
       (pred_7  obj_05 obj_03)
       (pred_7  obj_12 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_22)
       (pred_2 obj_16)
       (pred_2 obj_09)
       (pred_2 obj_21)
       (pred_2 obj_15)
       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_27)
       (pred_2 obj_08)
       (pred_2 obj_24)
       (pred_2 obj_18)
       (pred_2 obj_13)
       (pred_2 obj_26)
       (pred_2 obj_25)
       (pred_2 obj_30)
       (pred_2 obj_17)
       (pred_2 obj_28)
       (pred_2 obj_10)
       (pred_2 obj_29)
       (pred_2 obj_23)
       (pred_2 obj_07)

       (pred_1  obj_02 obj_20)
       (pred_1  obj_19 obj_03)
       (pred_1  obj_11 obj_20)
       (pred_6 obj_02 obj_22)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_11 obj_14)
       (pred_12 obj_23)
    )

    (:goal (and
       (pred_6 obj_11 obj_21)
    ))
(:constraints
  (always (not (pred_12 obj_04)))
)
)

; plan
1. (op_4 obj_23 obj_30)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_30)
   goals met: 0 of 1
2. (op_4 obj_30 obj_18)
   deleted: (pred_12 obj_30)
   added: (pred_12 obj_18)
   goals met: 0 of 1
3. (op_4 obj_18 obj_13)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_13)
   goals met: 0 of 1
4. (op_4 obj_13 obj_14)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_14)
   goals met: 0 of 1
5. (op_3 obj_14 obj_11)
   deleted: (pred_6 obj_11 obj_14) (pred_10)
   added: (pred_9 obj_11)
   goals met: 0 of 1
6. (op_4 obj_14 obj_13)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_13)
   goals met: 0 of 1
7. (op_4 obj_13 obj_18)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_18)
   goals met: 0 of 1
8. (op_4 obj_18 obj_24)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_24)
   goals met: 0 of 1
9. (op_4 obj_24 obj_15)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_15)
   goals met: 0 of 1
10. (op_4 obj_15 obj_21)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_21)
   goals met: 0 of 1
11. (op_1 obj_21 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_10) (pred_6 obj_11 obj_21)
   goals met: 1 of 1
